## Data Cleaning by Using Pyspark

In [1]:
from pyspark.sql import SparkSession
from pyspark.sql.functions import *
import pandas as pd

### Spark Session creation

In [2]:
from pyspark.sql import SparkSession

spark = SparkSession.builder \
    .appName("Spark Data cleaning") \
    .master("local[*]") \
    .getOrCreate()

print("Spark Session created")

Spark Session created

### Data path

In [274]:
data1="D:/OneDrive/Venkat.My_projects/BIG_Data_TAST_1/Finance_Input_Pyspark/users_data.csv"
data2="D:/OneDrive/Venkat.My_projects/BIG_Data_TAST_1/Finance_Input_Pyspark/cards_data.csv"
# data3="C:/Users/Admin/Downloads/finance data for pyspark/transactions_data.csv"

### Data 1 Cleaning

In [276]:
df1=spark.read.csv(data1,header=True,inferSchema=True)
df1.limit(10).toPandas()

,id,current_age,retirement_age,birth_year,birth_month,gender,address,latitude,longitude,per_capita_income,yearly_income,total_debt,credit_score,num_credit_cards
0,825,53,66,1966,11,Female,462 Rose Lane,34.15,-117.76,$29278,$59696,$127613,787,5
1,1746,53,68,1966,12,Female,3606 Federal Boulevard,40.76,-73.74,$37891,$77254,$191349,701,5
2,1718,81,67,1938,11,Female,766 Third Drive,34.02,-117.89,$22681,$33483,$196,698,5
3,708,63,63,1957,1,Female,3 Madison Street,40.71,-73.99,$163145,$249925,$202328,722,4
4,1164,43,70,1976,9,Male,9620 Valley Stream Drive,37.76,-122.44,$53797,$109687,$183855,675,1
5,68,42,70,1977,10,Male,58 Birch Lane,41.55,-90.60,$20599,$41997,$0,704,3
6,1075,36,67,1983,12,Female,5695 Fifth Street,38.22,-85.74,$25258,$51500,$102286,672,3
7,1711,26,67,1993,12,Male,1941 Ninth Street,45.51,-122.64,$26790,$54623,$114711,728,1
8,1116,81,66,1938,7,Female,11 Spruce Avenue,40.32,-75.32,$26273,$42509,$2895,755,5
9,1752,34,60,1986,1,Female,887 Grant Street,29.97,-92.12,$18730,$38190,$81262,810,1

In [277]:
# df3=spark.read.csv(data3,header=True,inferSchema=True)
# df3.toPandas()

In [279]:
df1.limit(1).toPandas()

,id,current_age,retirement_age,birth_year,birth_month,gender,address,latitude,longitude,per_capita_income,yearly_income,total_debt,credit_score,num_credit_cards
0,825,53,66,1966,11,Female,462 Rose Lane,34.15,-117.76,$29278,$59696,$127613,787,5

In [280]:
df1.printSchema()

root
 |-- id: integer (nullable = true)
 |-- current_age: integer (nullable = true)
 |-- retirement_age: integer (nullable = true)
 |-- birth_year: integer (nullable = true)
 |-- birth_month: integer (nullable = true)
 |-- gender: string (nullable = true)
 |-- address: string (nullable = true)
 |-- latitude: double (nullable = true)
 |-- longitude: double (nullable = true)
 |-- per_capita_income: string (nullable = true)
 |-- yearly_income: string (nullable = true)
 |-- total_debt: string (nullable = true)
 |-- credit_score: integer (nullable = true)
 |-- num_credit_cards: integer (nullable = true)

In [281]:
df1.describe().toPandas()

,summary,id,current_age,retirement_age,birth_year,birth_month,gender,address,latitude,longitude,per_capita_income,yearly_income,total_debt,credit_score,num_credit_cards
0,count,2000,2000,2000,2000,2000,2000,2000,2000,2000,2000,2000,2000,2000,2000
1,mean,999.5,45.3915,66.2375,1973.803,6.439,None,None,37.38922499999989,-91.55476499999995,None,None,None,709.7345,3.073
2,stddev,577.4945887192365,18.414091537014993,3.628867328663937,18.42123399587999,3.5653379667864167,None,None,5.11432396355345,16.28329261709689,None,None,None,67.22194883334225,1.6373794629690674
3,min,0,18,50,1918,1,Female,0 Elm Street,20.88,-159.41,$0,$1,$0,480,1
4,max,1999,101,79,2002,12,Male,9995 Pine Avenue,61.2,-68.67,$9995,$99883,$99840,850,9

In [282]:
df1.summary().toPandas()

,summary,id,current_age,retirement_age,birth_year,birth_month,gender,address,latitude,longitude,per_capita_income,yearly_income,total_debt,credit_score,num_credit_cards
0,count,2000,2000,2000,2000,2000,2000,2000,2000,2000,2000,2000,2000,2000,2000
1,mean,999.5,45.3915,66.2375,1973.803,6.439,None,None,37.38922499999989,-91.55476499999995,None,None,None,709.7345,3.073
2,stddev,577.4945887192365,18.414091537014993,3.628867328663937,18.42123399587999,3.5653379667864167,None,None,5.11432396355345,16.28329261709689,None,None,None,67.22194883334225,1.6373794629690674
3,min,0,18,50,1918,1,Female,0 Elm Street,20.88,-159.41,$0,$1,$0,480,1
4,25%,499,30,65,1961,3,None,None,33.83,-97.41,None,None,None,681,2
5,50%,999,44,66,1975,7,None,None,38.23,-86.44,None,None,None,711,3
6,75%,1499,58,68,1989,10,None,None,41.2,-80.13,None,None,None,753,4
7,max,1999,101,79,2002,12,Male,9995 Pine Avenue,61.2,-68.67,$9995,$99883,$99840,850,9

In [283]:
df1.columns

['id',
 'current_age',
 'retirement_age',
 'birth_year',
 'birth_month',
 'gender',
 'address',
 'latitude',
 'longitude',
 'per_capita_income',
 'yearly_income',
 'total_debt',
 'credit_score',
 'num_credit_cards']

In [284]:
df1.count()

2000

In [285]:
df1.dropna()

DataFrame[id: int, current_age: int, retirement_age: int, birth_year: int, birth_month: int, gender: string, address: string, latitude: double, longitude: double, per_capita_income: string, yearly_income: string, total_debt: string, credit_score: int, num_credit_cards: int]

In [286]:
df1.count()

2000

In [287]:
df1.dropDuplicates()

DataFrame[id: int, current_age: int, retirement_age: int, birth_year: int, birth_month: int, gender: string, address: string, latitude: double, longitude: double, per_capita_income: string, yearly_income: string, total_debt: string, credit_score: int, num_credit_cards: int]

In [288]:
df1.limit(1).toPandas()

,id,current_age,retirement_age,birth_year,birth_month,gender,address,latitude,longitude,per_capita_income,yearly_income,total_debt,credit_score,num_credit_cards
0,825,53,66,1966,11,Female,462 Rose Lane,34.15,-117.76,$29278,$59696,$127613,787,5

In [289]:
df1.schema["per_capita_income"].dataType

StringType()

In [290]:
df1 = df1.withColumn(
    "per_capita_income",
    regexp_replace(col("per_capita_income"), "[$,]", "").cast("int")
)

In [291]:
df1.schema["per_capita_income"].dataType

IntegerType()

In [292]:
df1.select("per_capita_income").show()

+-----------------+
|per_capita_income|
+-----------------+
|            29278|
|            37891|
|            22681|
|           163145|
|            53797|
|            20599|
|            25258|
|            26790|
|            26273|
|            18730|
|            27548|
|            22427|
|            33914|
|            20325|
|            10059|
|            11342|
|            17898|
|            21950|
|            26481|
|            17460|
+-----------------+
only showing top 20 rows

In [293]:
df1.schema["yearly_income"].dataType

StringType()

In [294]:
df1.select("yearly_income").limit(5).show()

+-------------+
|yearly_income|
+-------------+
|       $59696|
|       $77254|
|       $33483|
|      $249925|
|      $109687|
+-------------+

In [295]:
df1=df1.withColumn(
    "yearly_income",
    regexp_replace(col("yearly_income"),"[$]","").cast("int")
)

In [296]:
df1.schema["yearly_income"].dataType

IntegerType()

In [297]:
df1.select("yearly_income").limit(5).show()

+-------------+
|yearly_income|
+-------------+
|        59696|
|        77254|
|        33483|
|       249925|
|       109687|
+-------------+

In [298]:
df1.schema["total_debt"].dataType

StringType()

In [299]:
df1.select("total_debt").limit(5).show()

+----------+
|total_debt|
+----------+
|   $127613|
|   $191349|
|      $196|
|   $202328|
|   $183855|
+----------+

In [300]:
df1=df1.withColumn(
    "total_debt",
    regexp_replace(col("total_debt"),"[$]","").cast("int")
)

In [301]:
df1.schema["total_debt"].dataType

IntegerType()

In [302]:
df1.select("total_debt").limit(5).show()

+----------+
|total_debt|
+----------+
|    127613|
|    191349|
|       196|
|    202328|
|    183855|
+----------+

In [303]:
df1.printSchema()

root
 |-- id: integer (nullable = true)
 |-- current_age: integer (nullable = true)
 |-- retirement_age: integer (nullable = true)
 |-- birth_year: integer (nullable = true)
 |-- birth_month: integer (nullable = true)
 |-- gender: string (nullable = true)
 |-- address: string (nullable = true)
 |-- latitude: double (nullable = true)
 |-- longitude: double (nullable = true)
 |-- per_capita_income: integer (nullable = true)
 |-- yearly_income: integer (nullable = true)
 |-- total_debt: integer (nullable = true)
 |-- credit_score: integer (nullable = true)
 |-- num_credit_cards: integer (nullable = true)

### Data 2 Cleaning

In [304]:
df2=spark.read.csv(data2,header=True,inferSchema=True)
df2.toPandas()

,id,client_id,card_brand,card_type,card_number,expires,cvv,has_chip,num_cards_issued,credit_limit,acct_open_date,year_pin_last_changed,card_on_dark_web
0,4524,825,Visa,Debit,4344676511950444,12/2022,623,YES,2,$24295,09/2002,2008,No
1,2731,825,Visa,Debit,4956965974959986,12/2020,393,YES,2,$21968,04/2014,2014,No
2,3701,825,Visa,Debit,4582313478255491,02/2024,719,YES,2,$46414,07/2003,2004,No
3,42,825,Visa,Credit,4879494103069057,08/2024,693,NO,1,$12400,01/2003,2012,No
4,4659,825,Mastercard,Debit (Prepaid),5722874738736011,03/2009,75,YES,1,$28,09/2008,2009,No
...,...,...,...,...,...,...,...,...,...,...,...,...,...
6141,5361,185,Amex,Credit,300609782832003,01/2024,663,YES,1,$6900,11/2000,2013,No
6142,2711,185,Visa,Credit,4718517475996018,01/2021,492,YES,2,$5700,04/2012,2012,No
6143,1305,1007,Mastercard,Credit,5929512204765914,08/2020,237,NO,2,$9200,02/2012,2012,No
6144,743,1110,Mastercard,Debit,5589768928167462,01/2020,630,YES,1,$28074,01/2020,2020,No
6145,3199,1110,Visa,Credit,4994011318343994,12/2020,120,YES,1,$14400,05/2017,2017,No

In [305]:
df2.printSchema()

root
 |-- id: integer (nullable = true)
 |-- client_id: integer (nullable = true)
 |-- card_brand: string (nullable = true)
 |-- card_type: string (nullable = true)
 |-- card_number: long (nullable = true)
 |-- expires: string (nullable = true)
 |-- cvv: integer (nullable = true)
 |-- has_chip: string (nullable = true)
 |-- num_cards_issued: integer (nullable = true)
 |-- credit_limit: string (nullable = true)
 |-- acct_open_date: string (nullable = true)
 |-- year_pin_last_changed: integer (nullable = true)
 |-- card_on_dark_web: string (nullable = true)

In [306]:
df1.describe().toPandas()

,summary,id,current_age,retirement_age,birth_year,birth_month,gender,address,latitude,longitude,per_capita_income,yearly_income,total_debt,credit_score,num_credit_cards
0,count,2000,2000,2000,2000,2000,2000,2000,2000,2000,2000,2000,2000,2000,2000
1,mean,999.5,45.3915,66.2375,1973.803,6.439,None,None,37.38922499999989,-91.55476499999995,23141.928,45715.882,63709.694,709.7345,3.073
2,stddev,577.4945887192365,18.414091537014993,3.628867328663937,18.42123399587999,3.5653379667864167,None,None,5.11432396355345,16.28329261709689,11324.13735766499,22992.61545631198,52254.45342050286,67.22194883334225,1.6373794629690674
3,min,0,18,50,1918,1,Female,0 Elm Street,20.88,-159.41,0,1,0,480,1
4,max,1999,101,79,2002,12,Male,9995 Pine Avenue,61.2,-68.67,163145,307018,516263,850,9

In [307]:
df1.summary().toPandas()

,summary,id,current_age,retirement_age,birth_year,birth_month,gender,address,latitude,longitude,per_capita_income,yearly_income,total_debt,credit_score,num_credit_cards
0,count,2000,2000,2000,2000,2000,2000,2000,2000,2000,2000,2000,2000,2000,2000
1,mean,999.5,45.3915,66.2375,1973.803,6.439,None,None,37.38922499999989,-91.55476499999995,23141.928,45715.882,63709.694,709.7345,3.073
2,stddev,577.4945887192365,18.414091537014993,3.628867328663937,18.42123399587999,3.5653379667864167,None,None,5.11432396355345,16.28329261709689,11324.13735766499,22992.61545631198,52254.45342050286,67.22194883334225,1.6373794629690674
3,min,0,18,50,1918,1,Female,0 Elm Street,20.88,-159.41,0,1,0,480,1
4,25%,499,30,65,1961,3,None,None,33.83,-97.41,16823,32817,23971,681,2
5,50%,999,44,66,1975,7,None,None,38.23,-86.44,20581,40744,58250,711,3
6,75%,1499,58,68,1989,10,None,None,41.2,-80.13,26273,52680,89056,753,4
7,max,1999,101,79,2002,12,Male,9995 Pine Avenue,61.2,-68.67,163145,307018,516263,850,9

In [308]:
df2.columns

['id',
 'client_id',
 'card_brand',
 'card_type',
 'card_number',
 'expires',
 'cvv',
 'has_chip',
 'num_cards_issued',
 'credit_limit',
 'acct_open_date',
 'year_pin_last_changed',
 'card_on_dark_web']

In [309]:
df2.count()

6146

In [310]:
df2.dropna()

DataFrame[id: int, client_id: int, card_brand: string, card_type: string, card_number: bigint, expires: string, cvv: int, has_chip: string, num_cards_issued: int, credit_limit: string, acct_open_date: string, year_pin_last_changed: int, card_on_dark_web: string]

In [311]:
df2.dropDuplicates()

DataFrame[id: int, client_id: int, card_brand: string, card_type: string, card_number: bigint, expires: string, cvv: int, has_chip: string, num_cards_issued: int, credit_limit: string, acct_open_date: string, year_pin_last_changed: int, card_on_dark_web: string]

In [312]:
df2.printSchema()

root
 |-- id: integer (nullable = true)
 |-- client_id: integer (nullable = true)
 |-- card_brand: string (nullable = true)
 |-- card_type: string (nullable = true)
 |-- card_number: long (nullable = true)
 |-- expires: string (nullable = true)
 |-- cvv: integer (nullable = true)
 |-- has_chip: string (nullable = true)
 |-- num_cards_issued: integer (nullable = true)
 |-- credit_limit: string (nullable = true)
 |-- acct_open_date: string (nullable = true)
 |-- year_pin_last_changed: integer (nullable = true)
 |-- card_on_dark_web: string (nullable = true)

In [313]:
df2.limit(1).toPandas()

,id,client_id,card_brand,card_type,card_number,expires,cvv,has_chip,num_cards_issued,credit_limit,acct_open_date,year_pin_last_changed,card_on_dark_web
0,4524,825,Visa,Debit,4344676511950444,12/2022,623,YES,2,$24295,09/2002,2008,No

In [314]:
df2.select("credit_limit").limit(5).show()

+------------+
|credit_limit|
+------------+
|      $24295|
|      $21968|
|      $46414|
|      $12400|
|         $28|
+------------+

In [315]:
df2=df2.withColumn(
    "credit_limit",
    regexp_replace(col("credit_limit"),"[$]","").cast("int")
)

In [316]:
df2.select("credit_limit").limit(5).show()

+------------+
|credit_limit|
+------------+
|       24295|
|       21968|
|       46414|
|       12400|
|          28|
+------------+

In [317]:
df2.select("expires").limit(5).show()

+-------+
|expires|
+-------+
|12/2022|
|12/2020|
|02/2024|
|08/2024|
|03/2009|
+-------+

In [318]:
df2.schema["expires"].dataType

StringType()

In [319]:
df2=df2.withColumn("expires",to_date("expires","MM/yyyy"))

In [320]:
df2.select("expires").limit(5).show()

+----------+
|   expires|
+----------+
|2022-12-01|
|2020-12-01|
|2024-02-01|
|2024-08-01|
|2009-03-01|
+----------+

In [321]:
df2.schema["expires"].dataType

DateType()

In [322]:
df2=df2.withColumn("expires_month",month(col("expires")))

In [323]:
df2.select("expires_month").limit(3).show()

+-------------+
|expires_month|
+-------------+
|           12|
|           12|
|            2|
+-------------+

In [324]:
df2=df2.withColumn("expires_year",year(col('expires')))

In [325]:
df2.select("expires_year").limit(3).show()

+------------+
|expires_year|
+------------+
|        2022|
|        2020|
|        2024|
+------------+

In [326]:
df2.schema["acct_open_date"].dataType

StringType()

In [327]:
df2.select("acct_open_date").limit(5).show()

+--------------+
|acct_open_date|
+--------------+
|       09/2002|
|       04/2014|
|       07/2003|
|       01/2003|
|       09/2008|
+--------------+

In [328]:
df2=df2.withColumn("acct_open_date",to_date("acct_open_date","MM/yyyy"))

In [329]:
df2.schema["acct_open_date"].dataType

DateType()

In [330]:
df2.select("acct_open_date").limit(5).show()

+--------------+
|acct_open_date|
+--------------+
|    2002-09-01|
|    2014-04-01|
|    2003-07-01|
|    2003-01-01|
|    2008-09-01|
+--------------+

In [331]:
df1.printSchema()

root
 |-- id: integer (nullable = true)
 |-- current_age: integer (nullable = true)
 |-- retirement_age: integer (nullable = true)
 |-- birth_year: integer (nullable = true)
 |-- birth_month: integer (nullable = true)
 |-- gender: string (nullable = true)
 |-- address: string (nullable = true)
 |-- latitude: double (nullable = true)
 |-- longitude: double (nullable = true)
 |-- per_capita_income: integer (nullable = true)
 |-- yearly_income: integer (nullable = true)
 |-- total_debt: integer (nullable = true)
 |-- credit_score: integer (nullable = true)
 |-- num_credit_cards: integer (nullable = true)

In [332]:
df2.printSchema()

root
 |-- id: integer (nullable = true)
 |-- client_id: integer (nullable = true)
 |-- card_brand: string (nullable = true)
 |-- card_type: string (nullable = true)
 |-- card_number: long (nullable = true)
 |-- expires: date (nullable = true)
 |-- cvv: integer (nullable = true)
 |-- has_chip: string (nullable = true)
 |-- num_cards_issued: integer (nullable = true)
 |-- credit_limit: integer (nullable = true)
 |-- acct_open_date: date (nullable = true)
 |-- year_pin_last_changed: integer (nullable = true)
 |-- card_on_dark_web: string (nullable = true)
 |-- expires_month: integer (nullable = true)
 |-- expires_year: integer (nullable = true)

In [333]:
df1_cleaned=df1
df2_cleaned=df2

In [334]:
# Output path for cleaned data
output_path = "D:/OneDrive/Venkat.My_projects/BIG_Data_TAST_1/Finance_User_Cleaned_Data"

try:
    # Create output directory
    os.makedirs(output_path, exist_ok=True)
    
    # Cache the cleaned dataframe
    df1_cached = df1_cleaned.cache()
    final_count = df1_cached.count()
    print(f"Caching completed. Final row count: {final_count}")
    
    # Save as CSV
    df1_cached.coalesce(1).write.mode("overwrite") \
        .option("header", True) \
        .csv(output_path)
    
    print(f" Cleaned data saved successfully to: {output_path}")
    
    # List created files
    output_files = os.listdir(output_path)
    csv_files = [f for f in output_files if f.endswith('.csv')]
    print(f"Created CSV files: {csv_files}")
    
except Exception as e:
    print(f" Error saving data: {e}")

Caching completed. Final row count: 2000
 Cleaned data saved successfully to: D:/OneDrive/Venkat.My_projects/BIG_Data_TAST_1/Finance_User_Cleaned_Data
Created CSV files: ['part-00000-23fe2eda-2c1a-4952-a6a1-1d8b05ef3415-c000.csv']

In [335]:
# Output path for cleaned data
output_path = "D:/OneDrive/Venkat.My_projects/BIG_Data_TAST_1/Finance_Card_Cleaned_Data"

try:
    # Create output directory
    os.makedirs(output_path, exist_ok=True)
    
    # Cache the cleaned dataframe
    df2_cached = df2_cleaned.cache()
    final_count = df1_cached.count()
    print(f"Caching completed. Final row count: {final_count}")
    
    # Save as CSV
    df2_cached.coalesce(1).write.mode("overwrite") \
        .option("header", True) \
        .csv(output_path)
    
    print(f" Cleaned data saved successfully to: {output_path}")
    
    # List created files
    output_files = os.listdir(output_path)
    csv_files = [f for f in output_files if f.endswith('.csv')]
    print(f"Created CSV files: {csv_files}")
    
except Exception as e:
    print(f" Error saving data: {e}")

Caching completed. Final row count: 2000
 Cleaned data saved successfully to: D:/OneDrive/Venkat.My_projects/BIG_Data_TAST_1/Finance_Card_Cleaned_Data
Created CSV files: ['part-00000-26ec13a8-54f0-46c9-9ba8-6939af226d31-c000.csv']